brew '7-zip'
brew 'aria2'
brew 'btop'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
#brew 'dockutil'
#brew 'dos2unix'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gnu-tar'
brew 'gping'
#brew 'ipcalc'
brew 'jq'
brew 'mas'
brew 'mactop'
brew 'mole'
brew 'mosh'
brew 'mtr'
brew 'ncdu'
brew 'neovim'
brew 'openssh'
brew 'rename'
brew 'ripgrep'
brew 'socat'
brew 'stow'
brew 'starship'
brew 'gromgit/brewtils/taproom'
brew 'tlrc'
brew 'tmux'
#brew 'tor'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yt-dlp'
brew 'zoxide'
brew 'zsh'

#cask 'balenaetcher'
cask 'betterdisplay'
cask 'blackhole-2ch'
#cask 'calibre'
cask 'cloudflare-warp'
cask 'dropbox'
#cask 'firefox'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'ghostty'
cask 'google-chrome'
cask 'kap'
#cask 'ledger-live'
#cask 'postman'
cask 'raycast'
cask 'the-unarchiver'
#cask 'tomighty'
#cask 'tor-browser'
cask 'vlc'
#cask 'wireshark'
#cask 'xmind'

#cask 'discord'
#cask 'slack'
cask 'telegram'
#cask 'zoom'

#cask 'spotify'
#cask 'mutespotifyads'
#cask 'lyricsx'

### AI ###
brew "arimxyer/tap/models"
brew 'llmfit'

cask 'claude-devtools'

### dev ###
brew 'bat'
brew 'gh'
brew 'gist'
brew 'git'
brew 'lazygit'
#brew 'git-lfs'
#brew 'git-flow'

#brew 'chruby'
#brew 'ruby-install'
brew 'nvm'
#brew 'node'
#brew 'pyenv'
#brew 'mycli'
#brew 'redis'
#brew 'postgresql'
#cask 'pgadmin4'
#cask 'sqlitebrowser'
#brew 'mongodb'

cask 'visual-studio-code'

### devops ###
#cask 'vmware-fusion'
#cask "vagrant"

#brew 'packer'
#brew 'terraform'

#brew 'aws-iam-authenticator'
#brew 'awscli'
#brew 'awsebcli'
#brew 'amazon-ecs-cli'
#brew 'cli53'
#cask 'google-cloud-sdk'
#brew 's3cmd'

brew 'colima'
brew 'docker'
#brew 'k3d'
#brew 'k3sup'
#brew 'k9s'
#brew 'kind'
#brew 'kompose'
#brew 'krew'
#brew 'kubectx'
#brew 'kubespy'
#brew 'kubernetes-cli'
#brew 'kubernetes-helm'

### others ###
#cask 'obs'
#cask 'streamlabs-obs'
#cask 'scratch'
#cask 'gimp'

#mas 'Line', id: 539883307
#mas 'Windows App', id: 1295203466
#mas 'Pixelmator Pro', id: 1289583905
#mas 'Xcode', id: 497799835
#mas 'Final Cut Pro', id: 424389933
#mas 'UPDF', id: 1619925971
