brew 'aria2'
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
#brew 'dockutil'
#brew 'dos2unix'
brew 'fd'
brew 'fzf'
brew 'gnu-tar'
brew 'htop'
brew 'ipcalc'
#brew 'java11'
brew 'jq'
brew 'mas'
brew 'mosh'
brew 'mtr'
brew 'ncdu'
brew 'openssh'
brew 'p7zip'
brew 'prettyping'
#brew 'privoxy'
#brew 'proxychains-ng'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'socat'
brew 'stow'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
#brew 'tor'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'youtube-dl'
brew 'yt-dlp'
brew 'zsh'

tap 'homebrew/cask-versions'
cask '1password7'

tap 'homebrew/cask'
#cask 'adobe-reader'
#cask 'alfred'
#cask 'balenaetcher'
#cask 'bitbar'
cask 'blackhole-2ch'
#cask 'calibre'
cask 'cheatsheet'
cask 'dropbox'
#cask 'evernote'
cask 'firefox'
cask 'google-chrome'
#cask 'google-backup-and-sync'
#cask 'google-photos-backup-and-sync'
#cask 'headset'
cask 'iterm2'
cask 'kap'
#cask 'ledger-live'
#cask 'mounty'   # NTFS
#cask 'nally'
cask 'postman'
#cask 'rectangle'
cask 'raycast'
#cask 'skype'
#cask 'slack'
#cask 'telegram'
cask 'the-unarchiver'
cask 'tomighty'
#cask 'tor-browser'
cask 'vlc'
#cask 'wireshark'
#cask 'xmind'
#cask 'xnviewmp'
#cask 'xquartz'
cask 'zoom'

#cask 'spotify'
#cask 'mutespotifyads'
#cask 'lyricsx'

tap 'homebrew/cask-versions'
cask 'dash3'
#cask 'docker-edge'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'

### dev ###
brew 'bat'
brew 'gist'
brew 'git'
#brew 'git-lfs'
brew 'git-flow'
brew 'hub'
#cask 'sourcetree'

brew 'chruby', args: ['HEAD']
brew 'ruby-install', args: ['HEAD']
brew 'nvm'
brew 'node'
#brew 'pyenv'
#brew 'mycli'
#brew 'redis'
#brew 'postgresql'
#cask 'pgadmin4'
#cask 'sqlitebrowser'
#brew 'mongodb'
#cask 'robomongo'

#cask 'atom'
cask 'visual-studio-code'

### devops ###
#brew 'packer'
#brew 'terraform'
#cask 'vagrant'

#brew 'aws-iam-authenticator'
#brew 'awscli'
#brew 'awsebcli'
#brew 'amazon-ecs-cli'
#brew 'cli53'
#cask 'google-cloud-sdk'
#brew 's3cmd'

#cask 'docker'
brew 'colima'
#brew 'k3d'
#brew 'k3sup'
#brew 'k9s'
#brew 'kind'
#brew 'kompose'
#brew 'krew'
#brew 'kubectx'
#brew 'kubespy'
#brew 'kubernetes-cli'
#brew 'kubernetes-helm'

#cask 'virtualbox'
#cask 'virtualbox-extension-pack'

### others ###
#cask 'obs'
#cask 'streamlabs-obs'
#cask 'scratch'
#cask 'gimp'

#mas 'feedly', id: 865500966
#mas 'Line', id: 539883307
#mas 'Microsoft Remote Desktop', id: 1295203466
#mas 'Xcode', id: 497799835
#mas 'Pixelmator Pro', id: 1289583905
#mas 'Final Cut Pro', id: 424389933
#mas 'UPDF', id: 1619925971 
