brew 'aria2'
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'chruby', args: ['HEAD']
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'dockutil'
#brew 'dos2unix'
brew 'fd'
brew 'fzf'
brew 'gist'
brew 'git'
#brew 'git-lfs'
brew 'git-flow'
brew 'gnu-tar'
brew 'htop'
brew 'hub'
brew 'ipcalc'
brew 'jq'
brew 'mas'
brew 'mosh'
brew 'mtr'
brew 'ncdu'
brew 'node'
brew 'openssh'
#brew 'packer'
brew 'p7zip'
brew 'prettyping'
#brew 'privoxy'
#brew 'proxychains-ng'
#brew 'pyenv'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'ruby-install', args: ['HEAD']
brew 'socat'
brew 'ssh-copy-id'
brew 'stow'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
#brew 'tor'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'youtube-dl'

tap 'caskroom/cask'
cask '1password'
#cask 'adobe-reader'
cask 'alfred'
#cask 'atom'
cask 'balenaetcher'
cask 'bitbar'
#cask 'calibre'
cask 'cheatsheet'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
#cask 'google-backup-and-sync'
#cask 'google-photos-backup-and-sync'
#cask 'headset'
cask 'iterm2'
cask 'java'
#cask 'ledger-live'
#cask 'mounty'   # NTFS
#cask 'nally'
cask postman
cask 'shiftit'
#cask 'skype'
cask 'slack'
cask 'soundflower'
#cask 'sourcetree'
#cask 'spotify'
#cask 'spotifree'
#cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tomighty'
#cask 'tor-browser'
#cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
#cask 'wireshark'
#cask 'xmind'
#cask 'xnviewmp'
#cask 'xquartz'

tap 'homebrew/cask-versions'
cask 'dash3'
#cask 'docker-edge'

tap 'caskroom/fonts'
cask 'font-fira-code'

#mas 'feedly', id: 865500966
#mas 'Line', id: 539883307
#mas 'Microsoft Remote Desktop', id: 1295203466
#mas 'Xcode', id: 497799835

# dev
#brew mycli
#brew 'redis'
#brew 'postgresql'
#cask 'pgadmin4'
#cask 'sqlitebrowser'
#brew 'mongodb'
#cask 'robomongo'

# devops
#brew aws-iam-authenticator
#brew awscli
#brew awsebcli
#brew amazon-ecs-cli
#brew cli53
#cask google-cloud-sdk
#brew kompose
#brew kubectx
#brew kubernetes-cli
#brew kubernetes-helm
#brew s3cmd
#brew terraform
